# a = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
# b = [[9, 8, 7], [6, 5, 4], [3, 2, 1]]
# c = []
# for idx, row in enumerate(a):
#     d = []
#     for i, j in enumerate(row):
#         d.append(j + b[idx][i])
#     c.append(d)
# print(c)
#
# song = """
# Думи мої, думи мої,
# Лихо мені з вами!
# Нащо стали на папері
# Сумними рядами?..
# Чом вас вітер не розвіяв
# В степу, як пилину?
# Чом вас лихо не приспало,
# Як свою дитину?...
# За карії оченята,
# За чорнії брови
# Серце рвалося, сміялось,
# Виливало мову,
# Виливало, як уміло,
# За темнії ночі,
# За вишневий сад зелений,
# За ласки дівочі...
# За степи та за могили,
# Що на Україні,
# Серце мліло, не хотіло
# Співать на чужині...
# Не хотілось в снігу, в лісі,
# Козацьку громаду
# З булавами, з бунчугами
# Збирать на пораду.
# Нехай душі козацькії
# В Украйні витають –
# Там широко, там весело
# Од краю до краю...
# Як та воля, що минулась,
# Дніпр широкий – море,
# Степ і степ, ревуть пороги,
# І могили – гори, –
# Там родилась, гарцювала
# Козацькая воля;
# Там шляхтою, татарами
# Засідала поле,
# Засівала трупом поле,
# Поки не остило...
# """.split("\n")
# # print(song)
# d = ['Думи мої, думи   мої,', 'Лихо   мені з вами!', 'Нащо   стали на папері', 'Сумними рядами?..',
#      'Чом вас вітер не   розвіяв', 'В степу, як пилину?', 'Чом вас   лихо не приспало,', 'Як свою дитину?...',
#      'За   карії оченята,', 'За чорнії брови', 'Серце рвалося, сміялось,', 'Виливало   мову,', 'Виливало, як уміло,',
#      'За темнії ночі,', 'За   вишневий сад зелений,', 'За   ласки дівочі...', 'За степи та за   могили,', 'Що на Україні,',
#      'Серце мліло, не хотіло', 'Співать на чужині...', 'Не хотілось в снігу, в лісі,', 'Козацьку   громаду',
#      'З   булавами, з бунчугами', 'Збирать   на пораду.', 'Нехай душі козацькії', 'В Украйні витають –',
#      'Там широко, там весело', 'Од краю до краю...', 'Як та воля, що минулась,', 'Дніпр   широкий – море,',
#      'Степ і степ, ревуть пороги,', 'І могили –   гори, –', 'Там   родилась, гарцювала', 'Козацькая воля;',
#      'Там   шляхтою,   татарами', 'Засідала поле,', 'Засівала трупом поле,', 'Поки не остило...', '']
#
# for idx, row in enumerate(d):
#     while row.count('  '):
#         row = row.replace('  ', ' ')
#     d[idx] = row
#
# print(d)

m = [
    [1, 2, 3, 4],
    [5, 6, 7, 8],
    [9, 10, 11, 12],
    [13, 14, 15, 16]
]

for i in range(len(m)):
    for j in range(i + 1, len(m)):
        m[i][j], m[j][i] = m[j][i], m[i][j]

for r in m:
    for x in r:
        print(x, end='\t')
    print()

