"""
1) Напишите программу подсчета букв "a" в строке "abrakadabra".
2) Из строки "abrakadabra" удалите все сочетания "ab".
3) Напишите программу определения слова палиндрома (Это слова, которые одинаково читаются в обоих направлениях,
   например, анна, abba).
4) Напишите программу определения количества вхождений фраз "ra" в слове "abrakadabra".
5) Разделите введенное с клавиатуры предложение, на слова (слова разделяются пробелами)
"""

string = "abrakadabra"

# 1
print(string.count("a"))
