"""
На вход программы поступает строка в формате:

ключ_1=значение_1 ключ_2=значение_2 ... ключ_N=значение_N

Необходимо с помощью функции map преобразовать ее в
кортеж tp вида:

tp = (('ключ_1', 'значение_1'), ('ключ_2', 'значение_2'), ...,
('ключ_N', 'значение_N'))

Выводить на экран ничего не нужно, только преобразовать
строку в кортеж с именем tp.
"""

stroka = "house=дом car=машина men=человек tree=дерево"
s_lst = stroka.split()
print(s_lst)

tp = tuple([tuple(map(str, i.split("="))) for i in s_lst])
print(tp)